# 데이터 연결하기

## 여러 개 데이터셋 준비하기

In [1]:
import os
os.listdir()

['.ipynb_checkpoints',
 '00. 아나콘다를 활용한 파이썬 환경설정.ipynb',
 '01. 판다스기본.ipynb',
 '02. 판다스 데이터프레임과 시리즈.ipynb',
 '03. 그래프 그리기.ipynb',
 '04. 데이터 연결하기.ipynb',
 '05. 결측치 처리하기.ipynb',
 '06. 깔끔한(tidy) 데이터 만들기.ipynb',
 '07_done.ipynb',
 'data',
 'data2',
 'images',
 'notebook',
 'notebook.pkl',
 'notebook2',
 'output',
 'output2',
 'README.md',
 'Untitled.ipynb',
 'Untitled1.ipynb',
 'Untitled4.ipynb']

In [2]:
os.listdir(path = './data')

['banklist.csv',
 'billboard.csv',
 'concat',
 'country_timeseries.csv',
 'gapminder.tsv',
 'name.xls',
 'name.xlsx',
 'pew.csv',
 'raw_data_urls.txt',
 'sci.xls',
 'sci.xlsx',
 'scientists.csv',
 'scientists_df.csv',
 'scientists_df.pickle',
 'scientists_df.tsv',
 'scientists_name.csv',
 'scientists_name.pickle',
 'scientists_name.tsv',
 'tesla_stock_quandl.csv',
 'test1&2.pickle',
 'weather.csv',
 'weather_survey',
 '데이터연결연습용 데이터셋.zip']

In [3]:
os.listdir(path = './data/concat')

['concat_1.csv', 'concat_2.csv', 'concat_3.csv']

In [4]:
os.listdir(path = './data/weather_survey')

['survey_person.csv',
 'survey_site.csv',
 'survey_survey.csv',
 'survey_visited.csv']

In [5]:
import pandas as pd

df1 = pd.read_csv('./data/concat/concat_1.csv') 
df2 = pd.read_csv('./data/concat/concat_2.csv') 
df3 = pd.read_csv('./data/concat/concat_3.csv')

In [6]:
df1

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

In [7]:
df2

    A   B   C   D
0  a4  b4  c4  d4
1  a5  b5  c5  d5
2  a6  b6  c6  d6
3  a7  b7  c7  d7

In [8]:
df3

     A    B    C    D
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

## concat 메서드로 데이터셋을 행방향(위-아래)으로 결합하기

In [9]:
# concat 메서드를 활용해 데이터셋을 위아래 방향으로 결합
row_concat = pd.concat([df1, df2, df3]) 
print(row_concat)

# - 3개 데이터셋의 열이름이 모두 동일해 위아래로 연결되어 결합됨
# - 그러나 각 데이터셋의 원래 레코드 인덱스번호가 
#   그대로 유지되어 중복된 상태임

     A    B    C    D
0   a0   b0   c0   d0
1   a1   b1   c1   d1
2   a2   b2   c2   d2
3   a3   b3   c3   d3
0   a4   b4   c4   d4
1   a5   b5   c5   d5
2   a6   b6   c6   d6
3   a7   b7   c7   d7
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

In [10]:
# .loc 메서드 이용 특정 행 추출
print(row_concat.loc[3, ])
# .loc 메서드에 의해 인덱스3으로 표시된 모든 레코드가 추출됨

     A    B    C    D
3   a3   b3   c3   d3
3   a7   b7   c7   d7
3  a11  b11  c11  d11

In [11]:
# .iloc 메서드 이용 특정 행 추출
print(row_concat.iloc[3, ])
# .iloc 메서드에 의해 물리적으로 인덱스3에 해당하는 
#  네번째 레코드만 추출됨

A    a3
B    b3
C    c3
D    d3
Name: 3, dtype: object

#### 결합된 데이터셋의 행 인덱스 리셋방법

In [12]:
# concat 메서드를 활용해 데이터셋을 위아래 방향으로 결합
row_concat = pd.concat([df1, df2, df3], ignore_index = True) 
print(row_concat)

# - ignore_index = True 옵션으로 결합된 데이터셋의 행 인덱스번호가
#   원본과 상관없이 리셋되어 행 인덱스번호를 0부터 다시 설정함

      A    B    C    D
0    a0   b0   c0   d0
1    a1   b1   c1   d1
2    a2   b2   c2   d2
3    a3   b3   c3   d3
4    a4   b4   c4   d4
5    a5   b5   c5   d5
6    a6   b6   c6   d6
7    a7   b7   c7   d7
8    a8   b8   c8   d8
9    a9   b9   c9   d9
10  a10  b10  c10  d10
11  a11  b11  c11  d11

In [13]:
# .loc 메서드 이용 특정 행 추출
print(row_concat.loc[3, ])
# .loc 메서드에 의해 인덱스3으로 표시된 1개 레코드가 추출됨

A    a3
B    b3
C    c3
D    d3
Name: 3, dtype: object

In [14]:
# .iloc 메서드 이용 특정 행 추출
print(row_concat.iloc[3, ])
# .iloc 메서드에 의해 물리적으로 인덱스3에 해당하는 
#  네번째 레코드가 추출됨

A    a3
B    b3
C    c3
D    d3
Name: 3, dtype: object

## 데이터프레임에 시리즈로 레코드 추가하기

In [15]:
new_row_sr = pd.Series(['n1', 'n2', 'n3', 'n4'])
new_row_sr
print(type(new_row_sr))

<class 'pandas.core.series.Series'>

In [16]:
df1

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

In [17]:
# df1 데이터셋에 시리즈 형식인 new_row_sr을 레코드로 추가하려는 시도
pd.concat([df1, new_row_sr])
# - 레코드(행) 기준으로 서로 인덱스번호가 일치하는 게 없으며, 
#   변수컬럼(열)을 기준으로도 서로 일치하는 인덱스번호가 없는 상태라
#   별로 변수컬럼에 별도 레코드로 결합이 됨

     A    B    C    D    0
0   a0   b0   c0   d0  NaN
1   a1   b1   c1   d1  NaN
2   a2   b2   c2   d2  NaN
3   a3   b3   c3   d3  NaN
0  NaN  NaN  NaN  NaN   n1
1  NaN  NaN  NaN  NaN   n2
2  NaN  NaN  NaN  NaN   n3
3  NaN  NaN  NaN  NaN   n4

## 데이터프레임에 시리즈가 아닌 데이터프레임을 생성해 레코드 추가하기

In [18]:
new_row_df = pd.DataFrame(data = [['n1', 'n2', 'n3', 'n4']], 
                          columns=['A', 'B', 'C', 'D']) 
print(new_row_df)
print(type(new_row_df))

    A   B   C   D
0  n1  n2  n3  n4
<class 'pandas.core.frame.DataFrame'>

In [19]:
df1

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

In [20]:
# df1 데이터셋에 데이터프레임 형식인 new_row_df를 레코드로 추가하려는 시도
pd.concat([df1, new_row_df])
# - 변수컬럼(열)을 기준으로 서로 일치하므로 추가 레코드로 결합이 됨
# - 다만 레코드 인덱스번호는 그대로 유지됨

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
0  n1  n2  n3  n4

##### .append() 메서드 이용 1개 레코드만 추가할 때

In [21]:
# .append() 메서드를 사용한 1개 레코드 추가
df1.append(new_row_df, ignore_index = False )

# - 연결할 레코드가 1개 일때만 쉽게 사용가능함
# - ignore_index = 옵션을 True로 하면 인덱스가 리셋될 수 있음

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
0  n1  n2  n3  n4

##### 딕셔너리 포맷 이용 1개 레코드만 추가할 때

In [22]:
# 딕셔너리의 키(key)와 값(value)을 이용해 새로운 레코드 추가
data_dict = {'A': 'n1', 'B': 'n2', 'C': 'n3', 'D': 'n4'}
print(df1.append(data_dict, ignore_index = True))

# - 딕셔너리의 키(key)를 변수컬럼으로, 
#   값(value)을 해당 변수컬럼의 요소값(elements)로 설정함
# - ignore_index = True를 통해 결합된 데이터셋의 인덱스가 리셋됨

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  n1  n2  n3  n4

# 다양한 방법으로 데이터 연결하기

## 행 방향(위-아래)으로 데이터 연결하기

In [23]:
rowbind = pd.concat([df1, df2, df3], axis = 0, ignore_index = True) 
rowbind

      A    B    C    D
0    a0   b0   c0   d0
1    a1   b1   c1   d1
2    a2   b2   c2   d2
3    a3   b3   c3   d3
4    a4   b4   c4   d4
5    a5   b5   c5   d5
6    a6   b6   c6   d6
7    a7   b7   c7   d7
8    a8   b8   c8   d8
9    a9   b9   c9   d9
10  a10  b10  c10  d10
11  a11  b11  c11  d11

## 열 방향(좌-우)으로 데이터 연결하기

In [24]:
colbind = pd.concat([df1, df2, df3], axis = 1) 
colbind
# - 좌우방향으로 여러 데이터셋이 결합될 때
#   변수컬럼 중복에 상관없이 물리적으로 레코드수가 일치하면 그대로 결합시켜줌

    A   B   C   D   A   B   C   D    A    B    C    D
0  a0  b0  c0  d0  a4  b4  c4  d4   a8   b8   c8   d8
1  a1  b1  c1  d1  a5  b5  c5  d5   a9   b9   c9   d9
2  a2  b2  c2  d2  a6  b6  c6  d6  a10  b10  c10  d10
3  a3  b3  c3  d3  a7  b7  c7  d7  a11  b11  c11  d11

In [25]:
# 특정 열 추출
colbind['A']
# - 같은 이름을 가진 모든 변수컬럼이 추출됨

    A   A    A
0  a0  a4   a8
1  a1  a5   a9
2  a2  a6  a10
3  a3  a7  a11

In [26]:
# 특정 복수 열 추출
colbind[['A', 'C']]
# - 같은 이름을 가진 모든 변수컬럼이 추출됨

    A   A    A   C   C    C
0  a0  a4   a8  c0  c4   c8
1  a1  a5   a9  c1  c5   c9
2  a2  a6  a10  c2  c6  c10
3  a3  a7  a11  c3  c7  c11

In [27]:
# 특정 복수 열 추출
colbind.loc[:, ['A', 'C']]
# .loc() 메서드에 의해 같은 이름을 가진 모든 변수컬럼이 추출됨

    A   A    A   C   C    C
0  a0  a4   a8  c0  c4   c8
1  a1  a5   a9  c1  c5   c9
2  a2  a6  a10  c2  c6  c10
3  a3  a7  a11  c3  c7  c11

In [28]:
# 특정 복수 열 추출
colbind.iloc[:, [0, 2]]
# .iloc() 메서드에 의해 물리적으로 해당 인덱스 위치에 있는 변수컬럼만 추출됨

    A   C
0  a0  c0
1  a1  c1
2  a2  c2
3  a3  c3

#### 좌우로 결합된 데이터셋의 변수컬럼명 리셋방법

In [29]:
colbind = pd.concat([df1, df2, df3], axis = 1, ignore_index = True) 
colbind

   0   1   2   3   4   5   6   7    8    9    10   11
0  a0  b0  c0  d0  a4  b4  c4  d4   a8   b8   c8   d8
1  a1  b1  c1  d1  a5  b5  c5  d5   a9   b9   c9   d9
2  a2  b2  c2  d2  a6  b6  c6  d6  a10  b10  c10  d10
3  a3  b3  c3  d3  a7  b7  c7  d7  a11  b11  c11  d11

#### 데이터프레임에 변수컬럼 추가하기

In [30]:
colbind['new_col'] = ['n1', 'n2', 'n3', 'n4'] 
colbind

    0   1   2   3   4   5   6   7    8    9   10   11 new_col
0  a0  b0  c0  d0  a4  b4  c4  d4   a8   b8   c8   d8      n1
1  a1  b1  c1  d1  a5  b5  c5  d5   a9   b9   c9   d9      n2
2  a2  b2  c2  d2  a6  b6  c6  d6  a10  b10  c10  d10      n3
3  a3  b3  c3  d3  a7  b7  c7  d7  a11  b11  c11  d11      n4

# 조인(join): 공통 열과 공통 인덱스만 연결하기

### 대상 데이터셋 준비

In [31]:
# 현재 3개 데이터셋 상태
print(df1); print()
print(df2); print()
print(df3)

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

    A   B   C   D
0  a4  b4  c4  d4
1  a5  b5  c5  d5
2  a6  b6  c6  d6
3  a7  b7  c7  d7

     A    B    C    D
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

In [32]:
# 변수컬럼명을 3개 데이터셋별로 상이하게 설정함
df1.columns = ['A', 'B', 'C', 'D'] 
df2.columns = ['E', 'F', 'G', 'H'] 
df3.columns = ['A', 'C', 'F', 'H']

In [33]:
print(df1); print()
print(df2); print()
print(df3)

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

    E   F   G   H
0  a4  b4  c4  d4
1  a5  b5  c5  d5
2  a6  b6  c6  d6
3  a7  b7  c7  d7

     A    C    F    H
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

### 기존의 물리적인 행방향, 열방향으로 데이터셋 결합

In [34]:
# 2개 데이터셋 행방향(위-아래)로 결합
row_df1_df2 = pd.concat([df1, df2]) 
print(row_df1_df2)
# - 2개 데이터셋이 레코드수와 변수컬럼수는 동일하지만
#   행방향(위-아래) 결합될 수 있는 변수컬럼이 존재하지 않아서 
#   수많은 NaN 셀이 나타남

     A    B    C    D    E    F    G    H
0   a0   b0   c0   d0  NaN  NaN  NaN  NaN
1   a1   b1   c1   d1  NaN  NaN  NaN  NaN
2   a2   b2   c2   d2  NaN  NaN  NaN  NaN
3   a3   b3   c3   d3  NaN  NaN  NaN  NaN
0  NaN  NaN  NaN  NaN   a4   b4   c4   d4
1  NaN  NaN  NaN  NaN   a5   b5   c5   d5
2  NaN  NaN  NaN  NaN   a6   b6   c6   d6
3  NaN  NaN  NaN  NaN   a7   b7   c7   d7

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

In [35]:
# 2개 데이터셋 행방향(위-아래)로 결합
row_df1_df3 = pd.concat([df1, df3]) 
print(row_df1_df3)
# - 2개 데이터셋이 레코드수와 변수컬럼수는 동일한데,
#   행방향(위-아래)으로 결합될 수 있는 변수컬럼은 데이터가 연결되었으며, 
#   어느 한쪽에만 있는 변수컬럼에는 NaN이 존재하게 됨

     A    B    C    D    F    H
0   a0   b0   c0   d0  NaN  NaN
1   a1   b1   c1   d1  NaN  NaN
2   a2   b2   c2   d2  NaN  NaN
3   a3   b3   c3   d3  NaN  NaN
0   a8  NaN   b8  NaN   c8   d8
1   a9  NaN   b9  NaN   c9   d9
2  a10  NaN  b10  NaN  c10  d10
3  a11  NaN  b11  NaN  c11  d11

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

In [36]:
# 3개 데이터셋 행방향(위-아래)로 결합
row_df123 = pd.concat([df1, df2, df3]) 
print(row_df123)
# - 3개 데이터셋이 레코드수와 변수컬럼수는 동일한데,
#   행방향(위-아래)으로 결합될 수 있는 변수컬럼은 데이터가 연결되었으며, 
#   어느 한쪽에만 있는 변수컬럼에는 NaN이 존재하게 됨

     A    B    C    D    E    F    G    H
0   a0   b0   c0   d0  NaN  NaN  NaN  NaN
1   a1   b1   c1   d1  NaN  NaN  NaN  NaN
2   a2   b2   c2   d2  NaN  NaN  NaN  NaN
3   a3   b3   c3   d3  NaN  NaN  NaN  NaN
0  NaN  NaN  NaN  NaN   a4   b4   c4   d4
1  NaN  NaN  NaN  NaN   a5   b5   c5   d5
2  NaN  NaN  NaN  NaN   a6   b6   c6   d6
3  NaN  NaN  NaN  NaN   a7   b7   c7   d7
0   a8  NaN   b8  NaN  NaN   c8  NaN   d8
1   a9  NaN   b9  NaN  NaN   c9  NaN   d9
2  a10  NaN  b10  NaN  NaN  c10  NaN  d10
3  a11  NaN  b11  NaN  NaN  c11  NaN  d11

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

### 내부조인(inner-join) 방법으로 행방향(위-아래)로 결합

In [37]:
# 대상 데이터셋 조회
print(df1); print()
print(df2); print()
print(df3)

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

    E   F   G   H
0  a4  b4  c4  d4
1  a5  b5  c5  d5
2  a6  b6  c6  d6
3  a7  b7  c7  d7

     A    C    F    H
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

In [38]:
# 3개 데이터셋 내부조인: 공통 변수컬럼만으로 데이터셋 결합
pd.concat([df1, df2, df3], join = 'inner')
# - df1과 df3에는 공통변수컬럼이 있으나 
#   df2에 공통변수컬럼이 하나도 없으므로
#   아무런 결합이 되지 못함

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 0, 1, 2, 3, 0, 1, 2, 3]

In [39]:
# 대상 데이터셋 조회
print(df1); print()
print(df2); print()
print(df3)

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

    E   F   G   H
0  a4  b4  c4  d4
1  a5  b5  c5  d5
2  a6  b6  c6  d6
3  a7  b7  c7  d7

     A    C    F    H
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

In [40]:
# 2개 데이터셋 내부조인: 공통 변수컬럼만으로 데이터셋 결합
pd.concat([df1, df3], ignore_index = False, join = 'inner')
# - df1과 df3에 존재하는 공통변수컬럼을 기준으로 데이터셋을 결합함
# - ignore_index = 옵션도 True로 하여 결합시 행번호 인덱스를 리셋가능

     A    C
0   a0   c0
1   a1   c1
2   a2   c2
3   a3   c3
0   a8   b8
1   a9   b9
2  a10  b10
3  a11  b11

### 내부조인(inner-join) 방법으로 열방향(좌-우)으로 결합

In [41]:
# 대상 데이터셋 조회
print(df1); print()
print(df2); print()
print(df3)

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

    E   F   G   H
0  a4  b4  c4  d4
1  a5  b5  c5  d5
2  a6  b6  c6  d6
3  a7  b7  c7  d7

     A    C    F    H
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

In [42]:
# 대상 데이터셋의 인덱스 번호를 변경함
df1.index = [0, 1, 2, 3] 
df2.index = [4, 5, 6, 7] 
df3.index = [0, 2, 5, 7]

In [43]:
# 대상 데이터셋 조회: 인덱스 번호가 서로 상이하게 되어 있음
print(df1); print()
print(df2); print()
print(df3)

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

    E   F   G   H
4  a4  b4  c4  d4
5  a5  b5  c5  d5
6  a6  b6  c6  d6
7  a7  b7  c7  d7

     A    C    F    H
0   a8   b8   c8   d8
2   a9   b9   c9   d9
5  a10  b10  c10  d10
7  a11  b11  c11  d11

In [44]:
# 3개 데이터셋 열방향(좌-우) 결합
pd.concat([df1, df2, df3], axis = 1)
# - 각 데이터셋의 레코드 갯수는 일치하나
#   레코드 인덱스가 일치하지 않아서 좌우결합시
#   별도의 레코드로 나타남

     A    B    C    D    E    F    G    H    A    C    F    H
0   a0   b0   c0   d0  NaN  NaN  NaN  NaN   a8   b8   c8   d8
1   a1   b1   c1   d1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2   a2   b2   c2   d2  NaN  NaN  NaN  NaN   a9   b9   c9   d9
3   a3   b3   c3   d3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   a4   b4   c4   d4  NaN  NaN  NaN  NaN
5  NaN  NaN  NaN  NaN   a5   b5   c5   d5  a10  b10  c10  d10
6  NaN  NaN  NaN  NaN   a6   b6   c6   d6  NaN  NaN  NaN  NaN
7  NaN  NaN  NaN  NaN   a7   b7   c7   d7  a11  b11  c11  d11

In [45]:
# 3개 데이터셋 내부조인: 공통 레코드 인덱스만으로 데이터셋 결합
pd.concat([df1, df2, df3], axis = 1, join = 'inner')
# - df1과 df3에는 공통 레코드 인덱스가 있으나 
#   df2에 공통 레코드 인덱스가 하나도 없으므로
#   아무런 결합이 되지 못함

Empty DataFrame
Columns: [A, B, C, D, E, F, G, H, A, C, F, H]
Index: []

In [46]:
# 2개 데이터셋 내부조인: 공통 레코드인덱스만으로 데이터셋 결합
pd.concat([df1, df3], axis = 1, join = 'inner')
# - df1과 df3에 존재하는 공통 레코드 인덱스를 기준으로 데이터셋을 결합함

    A   B   C   D   A   C   F   H
0  a0  b0  c0  d0  a8  b8  c8  d8
2  a2  b2  c2  d2  a9  b9  c9  d9

# 판다스의 데이터연결전용 merge 메서드 사용하기

### raw데이터 준비하기

In [47]:
import os
os.listdir(path = './data')

['banklist.csv',
 'billboard.csv',
 'concat',
 'country_timeseries.csv',
 'gapminder.tsv',
 'name.xls',
 'name.xlsx',
 'pew.csv',
 'raw_data_urls.txt',
 'sci.xls',
 'sci.xlsx',
 'scientists.csv',
 'scientists_df.csv',
 'scientists_df.pickle',
 'scientists_df.tsv',
 'scientists_name.csv',
 'scientists_name.pickle',
 'scientists_name.tsv',
 'tesla_stock_quandl.csv',
 'test1&2.pickle',
 'weather.csv',
 'weather_survey',
 '데이터연결연습용 데이터셋.zip']

In [48]:
# 특정위치의 날씨정보 데이터 집합
person = pd.read_csv('./data/weather_survey/survey_person.csv') # 관측자 이름
site = pd.read_csv('./data/weather_survey/survey_site.csv') # 관측 위치
survey = pd.read_csv('./data/weather_survey/survey_survey.csv') # 날씨 정보
visited = pd.read_csv('./data/weather_survey/survey_visited.csv') # 관측 날짜

In [49]:
print(person) # 관측자 이름

      ident   personal    family
0      dyer    William      Dyer
1        pb      Frank   Pabodie
2      lake   Anderson      Lake
3       roe  Valentina   Roerich
4  danforth      Frank  Danforth

In [50]:
print(site) # 관측 위치

    name    lat    long
0   DR-1 -49.85 -128.57
1   DR-3 -47.15 -126.72
2  MSK-4 -48.87 -123.40

In [51]:
print(visited) # 관측 날짜

   ident   site       dated
0    619   DR-1  1927-02-08
1    622   DR-1  1927-02-10
2    734   DR-3  1939-01-07
3    735   DR-3  1930-01-12
4    751   DR-3  1930-02-26
5    752   DR-3         NaN
6    837  MSK-4  1932-01-14
7    844   DR-1  1932-03-22

In [52]:
print(survey) # 날씨 정보

    taken person quant  reading
0     619   dyer   rad     9.82
1     619   dyer   sal     0.13
2     622   dyer   rad     7.80
3     622   dyer   sal     0.09
4     734     pb   rad     8.41
5     734   lake   sal     0.05
6     734     pb  temp   -21.50
7     735     pb   rad     7.22
8     735    NaN   sal     0.06
9     735    NaN  temp   -26.00
10    751     pb   rad     4.35
11    751     pb  temp   -18.50
12    751   lake   sal     0.10
13    752   lake   rad     2.19
14    752   lake   sal     0.09
15    752   lake  temp   -16.00
16    752    roe   sal    41.60
17    837   lake   rad     1.46
18    837   lake   sal     0.21
19    837    roe   sal    22.50
20    844    roe   rad    11.25

In [53]:
# visited(관측 날짜) 데이터셋은 일부만 사용
visited_sub = visited.loc[[0, 2, 6], ]

### site(관측위치)와 visited_sub(관측 날짜) 서브 데이터셋 간 결합

In [54]:
print(site); print() # 관측위치
print(visited_sub); print() # 관측날짜 서브셋
print(visited) # 관측날짜 전체셋

    name    lat    long
0   DR-1 -49.85 -128.57
1   DR-3 -47.15 -126.72
2  MSK-4 -48.87 -123.40

   ident   site       dated
0    619   DR-1  1927-02-08
2    734   DR-3  1939-01-07
6    837  MSK-4  1932-01-14

   ident   site       dated
0    619   DR-1  1927-02-08
1    622   DR-1  1927-02-10
2    734   DR-3  1939-01-07
3    735   DR-3  1930-01-12
4    751   DR-3  1930-02-26
5    752   DR-3         NaN
6    837  MSK-4  1932-01-14
7    844   DR-1  1932-03-22

In [55]:
# site(관측위치)와 visited_sub(관측 날짜) 데이터셋 간 머지
site_visited_sub = site.merge(visited_sub, left_on='name', right_on='site', how = 'inner') 
print(site_visited_sub) 

# how옵션:left', 'right', 'outer', 'inner', 디폴트값은: 'inner'

    name    lat    long  ident   site       dated
0   DR-1 -49.85 -128.57    619   DR-1  1927-02-08
1   DR-3 -47.15 -126.72    734   DR-3  1939-01-07
2  MSK-4 -48.87 -123.40    837  MSK-4  1932-01-14

### site(관측위치)와 visited(관측 날짜) 데이터셋 간 결합

In [56]:
print(site); print() # 관측위치
print(visited) # 관측날짜 전체셋

    name    lat    long
0   DR-1 -49.85 -128.57
1   DR-3 -47.15 -126.72
2  MSK-4 -48.87 -123.40

   ident   site       dated
0    619   DR-1  1927-02-08
1    622   DR-1  1927-02-10
2    734   DR-3  1939-01-07
3    735   DR-3  1930-01-12
4    751   DR-3  1930-02-26
5    752   DR-3         NaN
6    837  MSK-4  1932-01-14
7    844   DR-1  1932-03-22

In [57]:
# site(관측위치)와 visited(관측날짜) 데이터셋 간 머지
site_visited = site.merge(visited, left_on='name', right_on='site') 
print(site_visited)

    name    lat    long  ident   site       dated
0   DR-1 -49.85 -128.57    619   DR-1  1927-02-08
1   DR-1 -49.85 -128.57    622   DR-1  1927-02-10
2   DR-1 -49.85 -128.57    844   DR-1  1932-03-22
3   DR-3 -47.15 -126.72    734   DR-3  1939-01-07
4   DR-3 -47.15 -126.72    735   DR-3  1930-01-12
5   DR-3 -47.15 -126.72    751   DR-3  1930-02-26
6   DR-3 -47.15 -126.72    752   DR-3         NaN
7  MSK-4 -48.87 -123.40    837  MSK-4  1932-01-14

### person(관측자)와 survey(날씨정보) 데이터셋 간 머지

In [58]:
print(person) # 관측자 이름
print()
print(survey.head()) # 날씨 정보

      ident   personal    family
0      dyer    William      Dyer
1        pb      Frank   Pabodie
2      lake   Anderson      Lake
3       roe  Valentina   Roerich
4  danforth      Frank  Danforth

   taken person quant  reading
0    619   dyer   rad     9.82
1    619   dyer   sal     0.13
2    622   dyer   rad     7.80
3    622   dyer   sal     0.09
4    734     pb   rad     8.41

In [59]:
# person(관측자)와 survey(날씨정보) 데이터셋 간 머지
person_survey = person.merge(survey, left_on='ident', right_on='person') 
person_survey.head()

  ident personal   family  taken person quant  reading
0  dyer  William     Dyer    619   dyer   rad     9.82
1  dyer  William     Dyer    619   dyer   sal     0.13
2  dyer  William     Dyer    622   dyer   rad     7.80
3  dyer  William     Dyer    622   dyer   sal     0.09
4    pb    Frank  Pabodie    734     pb   rad     8.41

### visited(관측날짜)와 survey(날씨정보) 데이터셋 간 머지

In [60]:
print(visited) # 관측 날짜
print()
print(survey.head()) # 날씨 정보

   ident   site       dated
0    619   DR-1  1927-02-08
1    622   DR-1  1927-02-10
2    734   DR-3  1939-01-07
3    735   DR-3  1930-01-12
4    751   DR-3  1930-02-26
5    752   DR-3         NaN
6    837  MSK-4  1932-01-14
7    844   DR-1  1932-03-22

   taken person quant  reading
0    619   dyer   rad     9.82
1    619   dyer   sal     0.13
2    622   dyer   rad     7.80
3    622   dyer   sal     0.09
4    734     pb   rad     8.41

In [61]:
# visited(관측날짜)와 survey(날씨정보) 데이터셋 간 머지
visited_survey = visited.merge(survey, left_on='ident', right_on='taken')
visited_survey.head()

   ident  site       dated  taken person quant  reading
0    619  DR-1  1927-02-08    619   dyer   rad     9.82
1    619  DR-1  1927-02-08    619   dyer   sal     0.13
2    622  DR-1  1927-02-10    622   dyer   rad     7.80
3    622  DR-1  1927-02-10    622   dyer   sal     0.09
4    734  DR-3  1939-01-07    734     pb   rad     8.41

### 다중 데이터간 머지

In [62]:
print(person); print() # 관측자 이름
print(site); print() # 관측 위치
print(visited); print() # 관측 날짜
print(survey.head()); print() # 날씨 정보

      ident   personal    family
0      dyer    William      Dyer
1        pb      Frank   Pabodie
2      lake   Anderson      Lake
3       roe  Valentina   Roerich
4  danforth      Frank  Danforth

    name    lat    long
0   DR-1 -49.85 -128.57
1   DR-3 -47.15 -126.72
2  MSK-4 -48.87 -123.40

   ident   site       dated
0    619   DR-1  1927-02-08
1    622   DR-1  1927-02-10
2    734   DR-3  1939-01-07
3    735   DR-3  1930-01-12
4    751   DR-3  1930-02-26
5    752   DR-3         NaN
6    837  MSK-4  1932-01-14
7    844   DR-1  1932-03-22

   taken person quant  reading
0    619   dyer   rad     9.82
1    619   dyer   sal     0.13
2    622   dyer   rad     7.80
3    622   dyer   sal     0.09
4    734     pb   rad     8.41

In [63]:
multi_merge = ps.merge(vs, left_on=['ident', 'taken', 'quant', 'reading'], right_on=['person', 'ident', 'quant', 'reading'])
multi_merge

NameError: name 'ps' is not defined

# End of Source